src/documentation.tex
% Created 2022-04-13 Wed 17:00
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Svoronos - Kanavas Iason}
\date{\today}
\title{Construction sites SonVis Algorithm documentation}
\hypersetup{
 pdfauthor={Svoronos - Kanavas Iason},
 pdftitle={Construction sites SonVis Algorithm documentation},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.0.6)},
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

Niklas meeting
Wed at 4 o'clock

\section{Algorithm architecture}
\label{sec:orgaa3e303}

\section{Interface}
\label{sec:org0bb0f45}
The interface consists of four visual elements.  The range slider and text input are used for date and time accordingly. Using these the user can specify a desired datetime period in the data to sonify and visualise.  The 'start' button is used so that the datetime period is extracted and then sent to be sonified and visualised, while the killall button can stop every running procedure in relation to the sonification and visualisation process anytime.

\subsection{Sub-processes}
\label{sec:orgc54f63c}
On launch, sclang is initialised and runs as a sub-process within the python session.  More specifically, the SuperCollider  patch for sonification is evaluated using the following command in Python.
\begin{verbatim}
# run sonification patch
sclang = subprocess.Popen(
    'sclang particleSonification.scd', shell=True,
    stdout=subprocess.PIPE,
    stderr=subprocess.STDOUT)
\end{verbatim}
Getting back now to the initialisation python script where a function obtains the IP address of the computer using a shell command and then stores it as a global variable.  After that, the OSC client configuration setup uses the variable's value (udp\(_{\text{client}}\) object).  The function is defined the following way as well as the OSC setup.  This process easily configures OSC intercommunication between python and SuperCollider therefore mistakes and hassle by hard-coding IP addresses or manual configurations are avoided.

\begin{verbatim}
# get IP address
def getip():
    global ip
    ip = subprocess.Popen(
        'ipconfig getifaddr en0', shell=True,
        stdout=subprocess.PIPE,
        stderr=subprocess.STDOUT)
    ip, _ = ip.communicate()
    ip = ip.decode('utf-8')
    ip = ip.strip()
    print(ip)

# Python osc
getip() # run getip function
client = udp_client.SimpleUDPClient(ip, 57120)
\end{verbatim}
\textbf{Note:} \emph{this works \textbf{only for macOs}.  Therefore it has to be adjusted for linux or windows.}

\vspace{0.2cm}
\noindent
WIN hint:
\begin{verbatim}
ipconfig | grep IPv4 Address.
\end{verbatim}


\section{data processing}
\label{sec:org5701d4c}
In this section the initial data processing takes place.
**


moving average low pass filter  -- for data cleaning

Meeting construction site sonification:
\section{Sonification}
\label{sec:org507888a}
\end{document}
